// Задание 1
let Tc = 5
let Tf = (9 / 5) * Tc + 32
alert('Задание 1, Tf = ' + Tf)

//  Задание 2
var admin, name = 'Василий'
admin = name
console.log('Задание 2, admin = ' + admin)

// Задание 3
console.log("Задание 3, 1000 + '108' = " + 1000 + '108')

// Задание 4

/* Атрибут defer сообщает браузеру, 
что он должен продолжать обрабатывать страницу 
и загружать скрипт в фоновом режиме, 
а затем запустить этот скрипт, когда он загрузится. */

/* Атрибут async означает, что скрипт абсолютно независим:
* Страница не ждёт асинхронных скриптов, содержимое обрабатывается и отображается.
* Событие DOMContentLoaded и асинхронные скрипты не ждут друг друга:
* DOMContentLoaded может произойти как до асинхронного скрипта (если асинхронный 
скрипт завершит загрузку после того, как страница будет готова),
* …так и после асинхронного скрипта (если он короткий или уже содержится в HTTP-кеше)
* Остальные скрипты не ждут async, и скрипты casync не ждут другие скрипты. */
